import type { IStepItem } from "~/types";


const steps: Array<IStepItem> = [

    {
        header: 'Контакт',
        text  : 'Если вам нужно сделать видеоролик, визитку или баннер, напишите мне на почту или телеграм.'
    },

    {
        header: 'Определение ТЗ',
        text  : 'Постановка задач. Получение информации о проекте. Определение сроков работы и четких требований. '
    },

    {
        header: 'Договор',
        text  : 'Оформление договора о работе с самозанятым. Выплата предоплаты в размере 50%.'
    },

    {
        header: 'Реализация',
        text  : 'Передача медиа материалов. Процесс монтажа видеоролики или создания визитки/баннера.'
    },

    {
        header: 'Завершение',
        text  : 'Передача результата работы в виде видеоролика или файла изображения. Полная оплата работы.'
    }
];


export default steps;